ЖКХ/src/InformationRegisters/Показания/Показания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Показания</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Показание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриборУчета</name>
    <type>
      <types>CatalogRef.ПриборыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/AccumulationRegisters/ПотреблениеРесурсов/ПотреблениеРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотреблениеРесурсов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПотреблениеРесурса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПриборУчета</name>
    <type>
      <types>CatalogRef.ПриборыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЖКХ/src/Documents/УчетПоказаний/УчетПоказаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетПоказаний</name>
  <registerRecords>InformationRegister.Показания</registerRecords>
  <registerRecords>AccumulationRegister.ПотреблениеРесурсов</registerRecords>
  <attributes>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показания</name>
    <attributes>
      <name>ПриборУчета</name>
      <type>
        <types>CatalogRef.ПриборыУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеУслуги</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖКХ/src/CommonForms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИтоговаяСтрока", Новый ОписаниеТипов("Строка")));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	КомандаОбновить = Команды.Добавить("ПК_Обновить");
	КомандаОбновить.Заголовок = "Обновить данные";
	КомандаОбновить.Действие = "ОбновитьДанные";
	
	НоваяКнопка = Элементы.Добавить("Обновить", Тип("КнопкаФормы"));
	НоваяКнопка.ИмяКоманды = "ПК_Обновить";
	
	// Строит элементы по свежим данным из базы и заполняет итоговую строку.
	ОбновитьПоказанияНаСервере();
	
	ГруппаИтогов = Элементы.Добавить("ГруппаИтогов", Тип("ГруппаФормы"));
	ГруппаИтогов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаИтогов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлементИтогов = Элементы.Добавить("ПоследниеПоказания", Тип("ПолеФормы"), ГруппаИтогов);
	НовыйЭлементИтогов.ПутьКДанным = "ИтоговаяСтрока";
	НовыйЭлементИтогов.Заголовок = "Последние показания";
	НовыйЭлементИтогов.Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Перечитывает показания из базы и синхронно приводит состав элементов формы в соответствие
// с полученными данными: добавляет отсутствующие приборы, удаляет исчезнувшие, обновляет значения и цвета.
//
&НаСервере
Процедура ОбновитьПоказанияНаСервере()
	
	РезультатЗапроса.Загрузить(ПолучитьЗначения());
	
	// Имена элементов приборов: ПриборУчета -> имя элемента формы.
	ИменаЭлементов = ИменаЭлементовПриборов();
	
	// Имена элементов приборов, присутствующих в свежей выборке.
	ИменаПриборовВДанных = Новый Соответствие;
	Для каждого КлючИЗначение Из ИменаЭлементов Цикл
		ИменаПриборовВДанных.Вставить(КлючИЗначение.Значение, Истина);
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	ИменаСуществующихРеквизитов = Новый Соответствие;
	
	// Удаляем реквизиты и группы приборов, которых больше нет в данных.
	Для каждого РеквизитФормы Из ПолучитьРеквизиты() Цикл
		
		ИмяРеквизита = РеквизитФормы.Имя;
		ИменаСуществующихРеквизитов.Вставить(ИмяРеквизита, Истина);
		
		Если Лев(ИмяРеквизита, 3) <> "ПУ_" Или ИменаПриборовВДанных[ИмяРеквизита] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УдаляемыеРеквизиты.Добавить(ИмяРеквизита);
		УдаляемыеРеквизиты.Добавить("Оборот" + ИмяРеквизита);
		УдаляемыеРеквизиты.Добавить("СреднееЗначение" + ИмяРеквизита);
		УдаляемыеРеквизиты.Добавить("Процент" + ИмяРеквизита);
		
		ГруппаПрибора = Элементы.Найти("Группа_" + ИмяРеквизита);
		Если ГруппаПрибора <> Неопределено Тогда
			Элементы.Удалить(ГруппаПрибора);
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавляем реквизиты для приборов, которых еще нет на форме.
	ДобавленныеПриборы = Новый Соответствие;
	Для каждого СтрокаРезультата Из РезультатЗапроса Цикл
		
		ИмяЭлемента = ИменаЭлементов[СтрокаРезультата.ПриборУчета];
		
		Если ИменаСуществующихРеквизитов[ИмяЭлемента] <> Неопределено
			Или ДобавленныеПриборы[ИмяЭлемента] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныеПриборы.Вставить(ИмяЭлемента, Истина);
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов("СправочникСсылка.ПриборыУчета")));
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("Оборот" + ИмяЭлемента, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3))));
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("СреднееЗначение" + ИмяЭлемента, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3))));
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("Процент" + ИмяЭлемента, Новый ОписаниеТипов("Строка")));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// Создаем недостающие элементы и заполняем значения.
	ИменаГруппПоТипамРесурсов = Новый Соответствие;
	
	Для каждого СтрокаРезультата Из РезультатЗапроса Цикл
		
		ИмяЭлемента = ИменаЭлементов[СтрокаРезультата.ПриборУчета];
		ИмяГруппыТипа = ОбеспечитьГруппуТипаРесурса(СтрокаРезультата.ТипРесурса, ИменаГруппПоТипамРесурсов);
		
		ИмяГруппыПрибора = "Группа_" + ИмяЭлемента;
		Если Элементы.Найти(ИмяГруппыПрибора) = Неопределено Тогда
			
			ГруппаПрибора = Элементы.Добавить(ИмяГруппыПрибора, Тип("ГруппаФормы"), Элементы[ИмяГруппыТипа]);
			ГруппаПрибора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаПрибора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			ПолеПрибор = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаПрибора);
			ПолеПрибор.ПутьКДанным = ИмяЭлемента;
			ПолеПрибор.Заголовок = "Прибор учета";
			
			ПолеОборот = Элементы.Добавить("Оборот" + ИмяЭлемента, Тип("ПолеФормы"), ГруппаПрибора);
			ПолеОборот.ПутьКДанным = "Оборот" + ИмяЭлемента;
			ПолеОборот.Заголовок = "Оборот";
			ПолеОборот.Формат = "ЧДЦ=1";
			
			ПолеСреднее = Элементы.Добавить("СреднееЗначение" + ИмяЭлемента, Тип("ПолеФормы"), ГруппаПрибора);
			ПолеСреднее.ПутьКДанным = "СреднееЗначение" + ИмяЭлемента;
			ПолеСреднее.Заголовок = "Среднее значение";
			ПолеСреднее.Формат = "ЧДЦ=1";
			
			ПолеПроцент = Элементы.Добавить("Процент" + ИмяЭлемента, Тип("ПолеФормы"), ГруппаПрибора);
			ПолеПроцент.ПутьКДанным = "Процент" + ИмяЭлемента;
			ПолеПроцент.Заголовок = "Процент";
			
		КонецЕсли;
		
		ЭтотОбъект[ИмяЭлемента] = СтрокаРезультата.ПриборУчета;
		ЭтотОбъект["Оборот" + ИмяЭлемента] = СтрокаРезультата.Оборот;
		ЭтотОбъект["СреднееЗначение" + ИмяЭлемента] = СтрокаРезультата.СреднееЗначение;
		ЭтотОбъект["Процент" + ИмяЭлемента] = Формат(СтрокаРезультата.Процент, "ЧДЦ=1; ЧН=0") + "%";
		
		УстановитьЦветаПоказаний(ИмяЭлемента, СтрокаРезультата.Оборот, СтрокаРезультата.СреднееЗначение);
		
	КонецЦикла;
	
	СформироватьИтоговуюСтроку();
	
КонецПроцедуры

// Возвращает имя группы формы для типа ресурса, создавая группу при ее отсутствии.
// Для незаполненного типа ресурса возвращает группу "Прочие".
//
// Параметры:
//  СсылкаТипаРесурса - СправочникСсылка.ТипыРесурсов - тип ресурса.
//  КэшИмен - Соответствие из СправочникСсылка.ТипыРесурсов, Строка - кэш "тип ресурса - имя группы"
//            в рамках одного построения формы.
//
// Возвращаемое значение:
//  Строка - имя элемента формы.
//
&НаСервере
Функция ОбеспечитьГруппуТипаРесурса(СсылкаТипаРесурса, КэшИмен)
	
	Если Не ЗначениеЗаполнено(СсылкаТипаРесурса) Тогда
		Возврат ИмяГруппыПрочихРесурсов();
	КонецЕсли;
	
	ИмяГруппы = КэшИмен[СсылкаТипаРесурса];
	Если ИмяГруппы = Неопределено Тогда
		ИмяГруппы = ИмяГруппыТипаРесурса(СсылкаТипаРесурса);
		КэшИмен.Вставить(СсылкаТипаРесурса, ИмяГруппы);
	КонецЕсли;
	
	Если Элементы.Найти(ИмяГруппы) = Неопределено Тогда
		Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"));
		Группа.Заголовок = СсылкаТипаРесурса.Наименование;
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

// Окрашивает поля оборота и процента прибора в зависимости от сравнения со средним значением.
//
// Параметры:
//  ИмяЭлемента - Строка - имя реквизита/элемента прибора учета.
//  Оборот - Число - потребление за период.
//  СреднееЗначение - Число - среднее потребление за год.
//
&НаСервере
Процедура УстановитьЦветаПоказаний(ИмяЭлемента, Оборот, СреднееЗначение)
	
	ПолеОборот = Элементы["Оборот" + ИмяЭлемента];
	ПолеПроцент = Элементы["Процент" + ИмяЭлемента];
	
	ПолеОборот.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	ПолеПроцент.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	
	Если Оборот < СреднееЗначение Тогда
		
		ПолеОборот.ЦветТекста = WebЦвета.Зеленый;
		ПолеПроцент.ЦветТекста = WebЦвета.Зеленый;
		
	ИначеЕсли Оборот > СреднееЗначение Тогда
		
		ПолеОборот.ЦветТекста = WebЦвета.Коралловый;
		ПолеПроцент.ЦветТекста = WebЦвета.Коралловый;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИтоговуюСтроку()
	
	ПоследнийДень = ПолучитьДату();
	СекСутки = 86400; // Секунд в сутках
	День = Цел((НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(ПоследнийДень)) / СекСутки);
	ЭтотОбъект.ИтоговаяСтрока = ?(
		ПоследнийДень = '00010101',
		"Нет показаний",
		"Прошло " + День + " дней с последней даты.");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДату()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	УчетПоказаний.Дата КАК Дата
	               |ИЗ
	               |	Документ.УчетПоказаний КАК УчетПоказаний
	               |ГДЕ
	               |	УчетПоказаний.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат Результат[0].Дата;
	
КонецФункции

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОбновитьПоказанияНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ПоказанияСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ МаксимальныйПериод
	|ИЗ
	|	РегистрСведений.Показания.СрезПоследних КАК ПоказанияСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотреблениеРесурсовОбороты.ПриборУчета КАК ПриборУчета,
	|	СРЕДНЕЕ(ПотреблениеРесурсовОбороты.ПотреблениеРесурсаОборот) КАК СреднееЗначение
	|ПОМЕСТИТЬ СреднееЗаГод
	|ИЗ
	|	МаксимальныйПериод КАК МаксимальныйПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотреблениеРесурсов.Обороты(,, Месяц,) КАК ПотреблениеРесурсовОбороты
	|		ПО ПотреблениеРесурсовОбороты.Период МЕЖДУ НАЧАЛОПЕРИОДА(МаксимальныйПериод.Период, ГОД) И МаксимальныйПериод.Период
	|СГРУППИРОВАТЬ ПО
	|	ПотреблениеРесурсовОбороты.ПриборУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотреблениеРесурсовОбороты.Период КАК Период,
	|	ПотреблениеРесурсовОбороты.ПриборУчета КАК ПриборУчета,
	|	ПотреблениеРесурсовОбороты.ПриборУчета.Код КАК КодПрибораУчета,
	|	ПотреблениеРесурсовОбороты.ПриборУчета.ВидРесурса.Тип КАК ТипРесурса,
	|	ПотреблениеРесурсовОбороты.ПотреблениеРесурсаОборот КАК Оборот,
	|	СреднееЗаГод.СреднееЗначение КАК СреднееЗначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СреднееЗаГод.СреднееЗначение, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПотреблениеРесурсовОбороты.ПотреблениеРесурсаОборот / СреднееЗаГод.СреднееЗначение * 100
	|	КОНЕЦ КАК Процент
	|ИЗ
	|	РегистрНакопления.ПотреблениеРесурсов.Обороты(,, Месяц,) КАК ПотреблениеРесурсовОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Показания.СрезПоследних КАК ПоказанияСрезПоследних
	|		ПО ПотреблениеРесурсовОбороты.Период = ПоказанияСрезПоследних.Период
	|		И ПотреблениеРесурсовОбороты.ПриборУчета = ПоказанияСрезПоследних.ПриборУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериод КАК МаксимальныйПериод
	|		ПО МаксимальныйПериод.Период = ПотреблениеРесурсовОбороты.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СреднееЗаГод КАК СреднееЗаГод
	|		ПО ПотреблениеРесурсовОбороты.ПриборУчета = СреднееЗаГод.ПриборУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПотреблениеРесурсовОбороты.ПриборУчета.ВидРесурса.Тип";
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

// Возвращает имя группы формы для типа ресурса.
// Имя строится из кода (уникален и допустим), при пустом коде - из GUID без разделителей.
// Одно и то же значение используется и при создании группы, и при ее поиске.
//
// Параметры:
//  СсылкаТипаРесурса - СправочникСсылка.ТипыРесурсов - тип ресурса.
//
// Возвращаемое значение:
//  Строка - имя элемента формы.
//
&НаСервере
Функция ИмяГруппыТипаРесурса(СсылкаТипаРесурса)
	
	Ключ = "";
	Если ЗначениеЗаполнено(СсылкаТипаРесурса) Тогда
		Ключ = СокрЛП(Строка(СсылкаТипаРесурса.Код));
	КонецЕсли;
	
	Если ПустаяСтрока(Ключ) Тогда
		Ключ = СтрЗаменить(Строка(СсылкаТипаРесурса.УникальныйИдентификатор()), "-", "");
	КонецЕсли;
	
	Возврат "Группа_" + Ключ;
	
КонецФункции

// Формирует имена элементов формы для приборов учета по данным РезультатЗапроса.
// Имя строится из кода прибора; при совпадении кодов (в том числе пустых) к имени
// добавляется GUID прибора, чтобы имена элементов оставались уникальными.
//
// Возвращаемое значение:
//  Соответствие из СправочникСсылка.ПриборыУчета, Строка - имя элемента формы по прибору учета.
//
&НаСервере
Функция ИменаЭлементовПриборов()
	
	КоличествоПоКоду = Новый Соответствие;
	Для каждого СтрокаРезультата Из РезультатЗапроса Цикл
		Код = КодПрибораУчетаВИмени(СтрокаРезультата.КодПрибораУчета);
		КоличествоПоКоду.Вставить(Код, ?(КоличествоПоКоду[Код] = Неопределено, 1, КоличествоПоКоду[Код] + 1));
	КонецЦикла;
	
	Имена = Новый Соответствие;
	Для каждого СтрокаРезультата Из РезультатЗапроса Цикл
		
		Код = КодПрибораУчетаВИмени(СтрокаРезультата.КодПрибораУчета);
		Имя = "ПУ_" + Код;
		
		Если КоличествоПоКоду[Код] > 1 Тогда
			УникальныйКлюч = СтрЗаменить(Строка(СтрокаРезультата.ПриборУчета.УникальныйИдентификатор()), "-", "");
			Имя = Имя + "_" + УникальныйКлюч;
		КонецЕсли;
		
		Имена.Вставить(СтрокаРезультата.ПриборУчета, Имя);
		
	КонецЦикла;
	
	Возврат Имена;
	
КонецФункции

// Возвращает код прибора учета, пригодный для использования в имени элемента формы.
//
// Параметры:
//  КодПрибораУчета - Строка - код прибора учета.
//
// Возвращаемое значение:
//  Строка - код прибора учета, для пустого кода - "БезКода".
//
&НаСервере
Функция КодПрибораУчетаВИмени(КодПрибораУчета)
	
	Ключ = СокрЛП(Строка(КодПрибораУчета));
	Если ПустаяСтрока(Ключ) Тогда
		Ключ = "БезКода";
	КонецЕсли;
	
	Возврат Ключ;
	
КонецФункции

// Создает (однократно) группу для типов ресурсов, не найденных в справочнике.
//
// Возвращаемое значение:
//  Строка - имя элемента формы.
//
&НаСервере
Функция ИмяГруппыПрочихРесурсов()
	
	Имя = "Группа_Прочие";
	Если Элементы.Найти(Имя) = Неопределено Тогда
		Группа = Элементы.Добавить(Имя, Тип("ГруппаФормы"));
		Группа.Заголовок = "Прочие";
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

#КонецОбласти
